Examples/PythonIntegration/manipulatedPitzDaily/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

libs (
    "libpythonIntegration.so"
);

functions (
    adaptRelaxation
    {
        type pythonIntegration;
        startFile "$FOAM_CASE/startResidualScaling.py";
        executeFile "$FOAM_CASE/executeResidualScaling.py";
        endFile "$FOAM_CASE/endResidualScaling.py";
        parallelMasterOnly true;  // In parallel runs only the master needs to execute this
    }
);

// ************************************************************************* //
